testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_10000000____delay-ms_1____loss-rate-percent_0____clients-requests_10/3/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 427.45ms, 23.39 req/s, 223.18MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 95.40MB (100031270) total, 120B (120) headers (space savings 87.37%), 95.37MB (100000000) data
UDP datagram: 7106 sent, 82180 received
                     min         max         mean         sd        +/- sd
time for request:   399.05ms    417.42ms    408.49ms      6.45ms    60.00%
time for connect:     6.13ms     27.48ms     16.65ms      7.21ms    60.00%
time to 1st byte:    27.14ms     30.30ms     28.56ms      1.08ms    60.00%
req/s           :       2.34        2.36        2.35        0.01    60.00%